# **SQL Database**

_John Andrew Dixon_

---

##### **Imports**

In [5]:
import pandas as pd
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy.types import *
from sqlalchemy_utils import create_database, database_exists

##### **Data Load**

In [6]:
# Make it so that all of the dataframe's columns are shown
pd.set_option('display.max_columns', None)

In [7]:
title_basics_df = pd.read_csv("Data/title_basics.csv.gz")
title_basics_df.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002.0,NaN,126,Drama

In [8]:
title_ratings_df =  pd.read_csv("Data/title_ratings.csv.gz")
title_ratings_df.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1966
1  tt0000002            5.8       263
2  tt0000005            6.2      2607
3  tt0000006            5.2       181
4  tt0000007            5.4       816

In [10]:
TMDb_API_df = pd.read_csv("Data/first_decade_combined.csv.gz")
TMDb_API_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18154 entries, 0 to 18153
Data columns (total 26 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   imdb_id                18154 non-null  object
 1   adult                  18154 non-null  float64
 2   backdrop_path          9938 non-null   object
 3   belongs_to_collection  1357 non-null   object
 4   budget                 18154 non-null  float64
 5   genres                 18154 non-null  object
 6   homepage               3486 non-null   object
 7   id                     18154 non-null  float64
 8   original_language      18154 non-null  object
 9   original_title         18154 non-null  object
 10  overview               17703 non-null  object
 11  popularity             18154 non-null  float64
 12  poster_path            15929 non-null  object
 13  production_companies   18154 non-null  object
 14  production_countries   18154 non-null  object
 15  release_date           17880 non-null  object
 16  revenue                18154 non-null  float64
 17  runtime                18154 non-null  float64
 18  spoken_languages       18154 non-null  object
 19  status                 18154 non-null  object
 20  tagline                7589 non-null   object
 21  title                  18154 non-null  object
 22  video                  18154 non-null  float64
 23  vote_average           18154 non-null  float64
 24  vote_count             18154 non-null  float64
 25  certification          5624 non-null   object
dtypes: float64(9), object(17)
memory usage: 3.6+ MB

---

## **Database Creation**

In [11]:
# Format the connection to make
connection = "mysql+pymysql://root:root@localhost/movies"

In [12]:
# Create the connection engine
engine = create_engine(connection)

In [13]:
# Check if the database exists
if database_exists(connection):
    # Notify that the database exists
    print(f"The movies database exists!")
else:
    create_database(connection)

## **Table Creation**

##### **_title_ratings_**

In [14]:
# View Datatype info about the ratings DataFrame
title_ratings_df.dtypes

tconst            object
averageRating    float64
numVotes           int64
dtype: object

In [15]:
# Get the max length of the primary key "tconst"
key_len = title_ratings_df["tconst"].fillna("").map(len).max()

# Create the ratings schema
ratings_schema = {
    "tconst": String(key_len + 1),
    "averageRating": Float(),
    "numVotes": Integer()
}
ratings_schema

{'tconst': String(length=11), 'averageRating': Float(), 'numVotes': Integer()}

In [16]:
# Actually create the ratings table in the database
title_ratings_df.to_sql("title_ratings",
                  engine,
                  dtype=ratings_schema,
                  if_exists="replace",
                  index=False)

496798

In [17]:
# Set "tconst" as the primary key
engine.execute("ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);");

In [18]:
# View the schema to verify the primary key was added
query = """DESCRIBE title_ratings;"""
pd.read_sql(query, engine)

           Field         Type Null  Key Default Extra
0         tconst  varchar(11)   NO  PRI    None
1  averageRating        float  YES         None
2       numVotes          int  YES         None

In [19]:
# See the first 5 values of the "title_ratings" table
query = """
SELECT * FROM title_ratings
LIMIT 5;
"""
pd.read_sql(query, engine)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1966
1  tt0000002            5.8       263
2  tt0000005            6.2      2607
3  tt0000006            5.2       181
4  tt0000007            5.4       816

##### **_title_genres_**

In [20]:
# Split genres in the basics dataframe
title_basics_df["genres_split"] = title_basics_df["genres"].str.split(",")
# Explode the genres and get the unique values
unique_genres = sorted(title_basics_df["genres_split"].explode().unique())
unique_genres

['Action',
 'Adult',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Drama',
 'Family',
 'Fantasy',
 'Game-Show',
 'History',
 'Horror',
 'Music',
 'Musical',
 'Mystery',
 'News',
 'Reality-TV',
 'Romance',
 'Sci-Fi',
 'Short',
 'Sport',
 'Talk-Show',
 'Thriller',
 'War',
 'Western']

In [21]:
# Explode the "genres_split" column
title_genres_df = title_basics_df.explode("genres_split")
# Get all the rows but only the "genres_split" and "tconst"
title_genres_df = title_genres_df[["tconst", "genres_split"]]
title_genres_df.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0069049        Drama

In [22]:
# Rename the column to reflect the futue genre_id that'll replace the genre name
title_genres_df.rename(columns={"genres_split": "genre_id"}, inplace=True)
title_genres_df.head()

      tconst genre_id
0  tt0035423   Comedy
0  tt0035423  Fantasy
0  tt0035423  Romance
1  tt0062336    Drama
2  tt0069049    Drama

In [23]:
# Create a genre map
genre_map = dict(zip(unique_genres, range(len(unique_genres))))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

In [24]:
title_genres_df["genre_id"] = title_genres_df["genre_id"].map(genre_map)
title_genres_df.head()

      tconst  genre_id
0  tt0035423         5
0  tt0035423         9
0  tt0035423        18
1  tt0062336         7
2  tt0069049         7

In [25]:
# Actually create the ratings table in the database
title_genres_df.to_sql("title_genres",
                        engine,
                        if_exists="replace",
                        index=False)

161676

In [26]:
# View the schema to verify the primary key was added
query = """DESCRIBE title_genres;"""
pd.read_sql(query, engine)

      Field    Type Null Key Default Extra
0    tconst    text  YES        None
1  genre_id  bigint  YES        None

In [27]:
# See the first 5 values of the "title_genres" table
query = """
SELECT * FROM title_genres
LIMIT 5;
"""
pd.read_sql(query, engine)

      tconst  genre_id
0  tt0035423         5
1  tt0035423         9
2  tt0035423        18
3  tt0062336         7
4  tt0069049         7

##### _genres_

In [28]:
# Make the genre map into a dataframe
genres_df = pd.DataFrame({
    "genre_id": genre_map.values(),
    "genre_name": genre_map.keys()
})

In [29]:
# Add the table to the database
genres_df.to_sql("genres",
                 engine,
                 if_exists="replace",
                 index=False)

26

In [30]:
# Set "genre_id" as the primary key
engine.execute("ALTER TABLE genres ADD PRIMARY KEY (`genre_id`);");

In [31]:
# View the schema to verify the primary key was added
query = """DESCRIBE genres;"""
pd.read_sql(query, engine)

        Field    Type Null  Key Default Extra
0    genre_id  bigint   NO  PRI    None
1  genre_name    text  YES         None

In [32]:
# See the first 5 values of the "genres" table
query = """
SELECT * FROM genres
LIMIT 5;
"""
pd.read_sql(query, engine)

   genre_id genre_name
0         0     Action
1         1      Adult
2         2  Adventure
3         3  Animation
4         4  Biography

##### _tmdb_data_

In [36]:
# Extract only the relevant columns
TMDb_API_df = TMDb_API_df[["imdb_id", "revenue", "budget", "certification"]]
TMDb_API_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 18154 entries, 0 to 18153
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   imdb_id        18154 non-null  object
 1   revenue        18154 non-null  float64
 2   budget         18154 non-null  float64
 3   certification  5624 non-null   object
dtypes: float64(2), object(2)
memory usage: 709.1+ KB

In [37]:
# Get the datatypes of each column
TMDb_API_df.dtypes

imdb_id           object
revenue          float64
budget           float64
certification     object
dtype: object

In [38]:
# Get the max length of the primary key "tconst"
key_len = TMDb_API_df["imdb_id"].fillna("").map(len).max()
# Get the max length of the certification key column "certification"
cert_len = TMDb_API_df["certification"].fillna("").map(len).max()

# Create the TMDB_data schema
TMDb_data_schema = {
    "imdb_id": String(key_len + 1),
    "revenue": Float(),
    "budget": Float(),
    "certification": Text(cert_len + 1)
}
TMDb_data_schema

{'imdb_id': String(length=11),
 'revenue': Float(),
 'budget': Float(),
 'certification': Text(length=32)}

In [39]:
# Add the "tmdb_data" table to the database
TMDb_API_df.to_sql("tmdb_data",
                   engine,
                   dtype=TMDb_data_schema,
                   if_exists="replace",
                   index=False)

18154

In [40]:
# Set "imdb_id" as the primary key
engine.execute("ALTER TABLE tmdb_data ADD PRIMARY KEY (`imdb_id`);");

In [41]:
# View the schema to verify the primary key was added
query = """DESCRIBE tmdb_data;"""
pd.read_sql(query, engine)

           Field         Type Null  Key Default Extra
0        imdb_id  varchar(11)   NO  PRI    None
1        revenue        float  YES         None
2         budget        float  YES         None
3  certification     tinytext  YES         None

In [42]:
# See the first 5 values of the "tmdb_data" table
query = """
SELECT * FROM tmdb_data
LIMIT 5;
"""
pd.read_sql(query, engine)

     imdb_id     revenue      budget certification
0  tt0035423  76019000.0  48000000.0         PG-13
1  tt0088751         0.0    350000.0          None
2  tt0096056         0.0         0.0          None
3  tt0103340         0.0         0.0          None
4  tt0114447         0.0         0.0          None

#### _title_basics_

In [43]:
# Extract the necessary info from "title_basics"
title_basics_df = title_basics_df[["tconst", "primaryTitle", "startYear", "endYear", "runtimeMinutes"]]
title_basics_df.rename(columns={
    "primaryTitle": "primary_title", 
    "startYear": "start_year", 
    "endYear": "end_year", 
    "runtimeMinutes": "runtime_minutes"
}, inplace=True)
title_basics_df.head()

,tconst,primary_title,start_year,end_year,runtime_minutes
0,tt0035423,Kate & Leopold,2001.0,NaN,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,NaN,70
2,tt0069049,The Other Side of the Wind,2018.0,NaN,122
3,tt0088751,The Naked Monster,2005.0,NaN,100
4,tt0096056,Crime and Punishment,2002.0,NaN,126

In [44]:
# Get the datatypes of each column
title_basics_df.dtypes

tconst              object
primary_title       object
start_year         float64
end_year           float64
runtime_minutes      int64
dtype: object

In [45]:
# Get the max length of the primary key "tconst"
key_len = title_basics_df["tconst"].fillna("").map(len).max()
# Get the max length of the certification column "primary_title"
primary_title_len = title_basics_df["primary_title"].fillna("").map(len).max()

# Create the "title_basics" schema
title_basics_schema = {
    "tconst": String(key_len + 1),
    "primary_title": Text(primary_title_len + 1),
    "start_year": Float(),
    "end_year": Float(),
    "runtime_minutes": Integer()
}
title_basics_schema

{'tconst': String(length=11),
 'primary_title': Text(length=243),
 'start_year': Float(),
 'end_year': Float(),
 'runtime_minutes': Integer()}

In [46]:
# Add the "title_basics" table to the database
title_basics_df.to_sql("title_basics",
                       engine,
                       dtype=title_basics_schema,
                       if_exists="replace",
                       index=False)

86563

In [47]:
# Set "imdb_id" as the primary key
engine.execute("ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);");

In [48]:
# View the schema to verify the primary key was added
query = """DESCRIBE title_basics;"""
pd.read_sql(query, engine)

             Field         Type Null  Key Default Extra
0           tconst  varchar(11)   NO  PRI    None
1    primary_title         text  YES         None
2       start_year        float  YES         None
3         end_year        float  YES         None
4  runtime_minutes          int  YES         None

In [49]:
# See the first 5 values of the "title_basics" table
query = """
SELECT * FROM title_basics
LIMIT 5;
"""
pd.read_sql(query, engine)

,tconst,primary_title,start_year,end_year,runtime_minutes
0,tt0035423,Kate & Leopold,2001.0,None,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,None,70
2,tt0069049,The Other Side of the Wind,2018.0,None,122
3,tt0088751,The Naked Monster,2005.0,None,100
4,tt0096056,Crime and Punishment,2002.0,None,126

##### **_Final Table Verification_**

In [50]:
# Verify the tables were added by showing them
query = """SHOW TABLES;"""
pd.read_sql(query, engine)

  Tables_in_movies
0           genres
1     title_basics
2     title_genres
3    title_ratings
4        tmdb_data